In [2]:
import os
import pandas as pd
week_root = '/opt/notebooks/week_2'
frame = pd.read_csv(os.path.join(week_root, 'prepared/dataset.tsv'), header=0, sep='\t')
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [3]:
frame.dtypes

Name        object
Birth       object
City        object
Position    object
dtype: object

In [4]:
frame.Birth = frame.Birth.apply(pd.to_datetime)

In [14]:
frame.dtypes
frame

              Name      Birth       City  Position
0      Иванов А.А. 1980-03-22     Москва       NaN
1     Сорокин И.В. 1965-07-08  Волгоград   инженер
2       Белов М.М. 1980-02-13     Ростов  менеджер
3  Мельникова Д.С. 1985-04-15     Ростов       NaN
4      Рыбина Е.П. 1985-11-19     Москва   инженер
5     Костров С.О. 1985-05-31     Москва    стажер

In [15]:
pd.to_datetime

<function pandas.core.tools.datetimes.to_datetime(arg, errors='raise', dayfirst=False, yearfirst=False, utc=None, box=True, format=None, exact=True, unit=None, infer_datetime_format=False, origin='unix', cache=False)>

In [16]:
type(frame)

pandas.core.frame.DataFrame

In [17]:
frame.Birth

0   1980-03-22
1   1965-07-08
2   1980-02-13
3   1985-04-15
4   1985-11-19
5   1985-05-31
Name: Birth, dtype: datetime64[ns]

In [18]:
frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
Name        6 non-null object
Birth       6 non-null datetime64[ns]
City        6 non-null object
Position    4 non-null object
dtypes: datetime64[ns](1), object(3)
memory usage: 272.0+ bytes

In [19]:
frame.fillna('бла бла', inplace=True)
frame

              Name      Birth       City  Position
0      Иванов А.А. 1980-03-22     Москва   бла бла
1     Сорокин И.В. 1965-07-08  Волгоград   инженер
2       Белов М.М. 1980-02-13     Ростов  менеджер
3  Мельникова Д.С. 1985-04-15     Ростов   бла бла
4      Рыбина Е.П. 1985-11-19     Москва   инженер
5     Костров С.О. 1985-05-31     Москва    стажер

In [24]:
frame[['Name', 'Position']]

              Name  Position
0      Иванов А.А.   бла бла
1     Сорокин И.В.   инженер
2       Белов М.М.  менеджер
3  Мельникова Д.С.   бла бла
4      Рыбина Е.П.   инженер
5     Костров С.О.    стажер

In [25]:
frame[:3]

           Name      Birth       City  Position
0   Иванов А.А. 1980-03-22     Москва   бла бла
1  Сорокин И.В. 1965-07-08  Волгоград   инженер
2    Белов М.М. 1980-02-13     Ростов  менеджер

In [26]:
frame[2:5]

              Name      Birth    City  Position
2       Белов М.М. 1980-02-13  Ростов  менеджер
3  Мельникова Д.С. 1985-04-15  Ростов   бла бла
4      Рыбина Е.П. 1985-11-19  Москва   инженер

In [27]:
frame.tail(2)

           Name      Birth    City Position
4   Рыбина Е.П. 1985-11-19  Москва  инженер
5  Костров С.О. 1985-05-31  Москва   стажер

In [29]:
frame.loc[[0,1,2], ["Name", "City"]] #работает на основе имен

           Name       City
0   Иванов А.А.     Москва
1  Сорокин И.В.  Волгоград
2    Белов М.М.     Ростов

In [31]:
frame.iloc[[1,3,5], [0,3]]

              Name Position
1     Сорокин И.В.  инженер
3  Мельникова Д.С.  бла бла
5     Костров С.О.   стажер

In [32]:
frame[frame.Birth >= pd.datetime(1985,1,1)]

              Name      Birth    City Position
3  Мельникова Д.С. 1985-04-15  Ростов  бла бла
4      Рыбина Е.П. 1985-11-19  Москва  инженер
5     Костров С.О. 1985-05-31  Москва   стажер

In [38]:
frame[frame.Birth >= pd.datetime(1985,1,1)]

              Name      Birth    City Position
3  Мельникова Д.С. 1985-04-15  Ростов  бла бла
4      Рыбина Е.П. 1985-11-19  Москва  инженер
5     Костров С.О. 1985-05-31  Москва   стажер

In [40]:
frame.shape

(6, 4)

In [42]:
frame['isStudent'] = [False,False,True,True,False,True]
frame.shape
frame

              Name      Birth       City  Position  isStudent
0      Иванов А.А. 1980-03-22     Москва   бла бла      False
1     Сорокин И.В. 1965-07-08  Волгоград   инженер      False
2       Белов М.М. 1980-02-13     Ростов  менеджер       True
3  Мельникова Д.С. 1985-04-15     Ростов   бла бла       True
4      Рыбина Е.П. 1985-11-19     Москва   инженер      False
5     Костров С.О. 1985-05-31     Москва    стажер       True

In [49]:
frame[frame.Birth >= pd.datetime(1985,1,1)]

              Name      Birth    City Position  isStudent
3  Мельникова Д.С. 1985-04-15  Ростов  бла бла       True
4      Рыбина Е.П. 1985-11-19  Москва  инженер      False
5     Костров С.О. 1985-05-31  Москва   стажер       True

In [50]:
frame[frame.Birth >= pd.datetime(1985,1,1)].loc[[3,4], ['Name']]

              Name
3  Мельникова Д.С.
4      Рыбина Е.П.

In [51]:
frame[(frame.Birth >= pd.datetime(1985,1,1)) &
      (frame.City != 'Москва')]

              Name      Birth    City Position  isStudent
3  Мельникова Д.С. 1985-04-15  Ростов  бла бла       True

In [57]:
frame[(frame.Birth >= pd.datetime(1985,1,1)) &
      (frame.City != 'Москва')]

              Name      Birth    City Position  isStudent
3  Мельникова Д.С. 1985-04-15  Ростов  бла бла       True